/* The string for canceling a map editing function. */
"CancelKey" = "Zrušiť";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "Naozaj chcete zrušiť?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "Vaše zmeny sa neuložia.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "Objekt, ktorý ste vytvorili, sa neuloží.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "Zahodiť zmeny";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "Zrušiť úpravu";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "Neplatná adresa";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "Pre bod musí byť zahrnutá adresa";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "Pre tento bod ste nepridali umiestnenie";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "Nebude pridaný žiadny nový bod";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "Pokračovať v úprave";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "Vyberte bod, ktorý chcete odstrániť.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "Neexistujú žiadne body na odstránenie.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "OK";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "Naozaj chcete vymazať všetky body?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "Nie";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "Áno";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "Chcete prejsť na bod?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "Chcete prejsť na lomenú čiaru?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "Chcete prejsť na mnohouholník?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "Body, ktoré ste pridali, sa nezmenia a môžete pokračovať vo vytváraní objektu";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "Všetky pridané body sa odstránia";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "Naozaj chcete odstrániť tento bod?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "Uložiť";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "Filtrovať";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "Aktuálne umiestnenie";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "Nenašli sa žiadne návrhy";

/* The text of the editingPanel Address textField. */
"AddressKey" = "Adresa";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "Vymazať všetko";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "%@ bolo úspešne vytvorené";

/* The placeholder text of the Searchbar */
"SearchKey" = "Hľadať";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "Pridať nový bod";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "Základná mapa";

/* The title for the standard map type. */
"StandardKey" = "Štandardné";

/* The title for the hybrid map type. */
"HybridKey" = "Hybrid";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "Hybrid Flyover";

/* The title for the muted standard map type. */
"MutedStandardKey" = "Muted Standard";

/* The title for the satellite map type. */
"SatelliteKey" = "Satelit";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "Satellite Flyover";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "Pridať umiestnenie";

